Both start and end of web must intersect the truss.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TrussUserDefinedMemberNotJoined { get; }
  Visual Basic
Public Shared ReadOnly Property TrussUserDefinedMemberNotJoined As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TrussUserDefinedMemberNotJoined {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures TrussFailures Class
  Autodesk.Revit.DB Namespace